{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,25],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"embedding_Embedding1","class_name":"Embedding","config":{"input_dim":2500,"output_dim":128,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":null,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"multiply_layer_MultiplyLayer3","class_name":"MultiplyLayer","config":{"name":"multiply_layer_MultiplyLayer3","trainable":true},"inbound_nodes":[[["embedding_Embedding1",0,0,{}]]]},{"name":"add_layer_AddLayer3","class_name":"AddLayer","config":{"name":"add_layer_AddLayer3","trainable":true},"inbound_nodes":[[["multiply_layer_MultiplyLayer3",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["add_layer_AddLayer3",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention13","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention13","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}],["dense_Dense2",0,0,{}],["dense_Dense3",0,0,{}],["dropout_Dropout1",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention13",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization1","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization1","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"sequential_1","class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization1",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization5","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization5","trainable":true},"inbound_nodes":[[["sequential_1",1,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization5",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization5",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization5",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention14","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention14","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}],["dense_Dense5",0,0,{}],["dense_Dense6",0,0,{}],["layer_normalization_LayerNormalization5",0,0,{}]]]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization5",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention14",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization2","trainable":true},"inbound_nodes":[[["add_Add2",0,0,{}]]]},{"name":"sequential_2","class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization2",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization6","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization6","trainable":true},"inbound_nodes":[[["sequential_2",1,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization6",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization6",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization6",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention15","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention15","trainable":true},"inbound_nodes":[[["dense_Dense7",0,0,{}],["dense_Dense8",0,0,{}],["dense_Dense9",0,0,{}],["layer_normalization_LayerNormalization6",0,0,{}]]]},{"name":"add_Add3","class_name":"Add","config":{"name":"add_Add3","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization6",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention15",0,0,{}]]]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,25],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"layer_normalization_LayerNormalization3","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization3","trainable":true},"inbound_nodes":[[["add_Add3",0,0,{}]]]},{"name":"embedding_Embedding2","class_name":"Embedding","config":{"input_dim":2500,"output_dim":128,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":null,"name":"embedding_Embedding2","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"sequential_3","class_name":"Sequential","config":{"name":"sequential_3","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization3",0,0,{}]]]},{"name":"multiply_layer_MultiplyLayer4","class_name":"MultiplyLayer","config":{"name":"multiply_layer_MultiplyLayer4","trainable":true},"inbound_nodes":[[["embedding_Embedding2",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization7","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization7","trainable":true},"inbound_nodes":[[["sequential_3",1,0,{}]]]},{"name":"add_layer_AddLayer4","class_name":"AddLayer","config":{"name":"add_layer_AddLayer4","trainable":true},"inbound_nodes":[[["multiply_layer_MultiplyLayer4",0,0,{}]]]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization7",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization7",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization7",0,0,{}]]]},{"name":"dropout_Dropout6","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout6","trainable":true},"inbound_nodes":[[["add_layer_AddLayer4",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention16","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention16","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}],["dense_Dense11",0,0,{}],["dense_Dense12",0,0,{}],["layer_normalization_LayerNormalization7",0,0,{}]]]},{"name":"dense_Dense21","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true},"inbound_nodes":[[["dropout_Dropout6",0,0,{}]]]},{"name":"dense_Dense22","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true},"inbound_nodes":[[["dropout_Dropout6",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["dropout_Dropout6",0,0,{}]]]},{"name":"add_Add4","class_name":"Add","config":{"name":"add_Add4","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization7",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention16",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention17","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention17","trainable":true},"inbound_nodes":[[["dense_Dense21",0,0,{}],["dense_Dense22",0,0,{}],["dense_Dense23",0,0,{}],["dropout_Dropout6",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization4","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization4","trainable":true},"inbound_nodes":[[["add_Add4",0,0,{}]]]},{"name":"add_Add5","class_name":"Add","config":{"name":"add_Add5","trainable":true},"inbound_nodes":[[["dropout_Dropout6",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention17",0,0,{}]]]},{"name":"sequential_4","class_name":"Sequential","config":{"name":"sequential_4","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense19","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true}},{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization4",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization9","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization9","trainable":true},"inbound_nodes":[[["add_Add5",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization8","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization8","trainable":true},"inbound_nodes":[[["sequential_4",1,0,{}]]]},{"name":"dense_Dense33","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense33","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization9",0,0,{}]]]},{"name":"dense_Dense34","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense34","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"dense_Dense35","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense35","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention18","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention18","trainable":true},"inbound_nodes":[[["dense_Dense33",0,0,{}],["dense_Dense34",0,0,{}],["dense_Dense35",0,0,{}],["layer_normalization_LayerNormalization9",0,0,{}]]]},{"name":"add_Add9","class_name":"Add","config":{"name":"add_Add9","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization9",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention18",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization13","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization13","trainable":true},"inbound_nodes":[[["add_Add9",0,0,{}]]]},{"name":"sequential_5","class_name":"Sequential","config":{"name":"sequential_5","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense45","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense46","trainable":true}},{"class_name":"Dropout","config":{"rate":1,"noise_shape":null,"seed":null,"name":"dropout_Dropout7","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization13",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization17","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization17","trainable":true},"inbound_nodes":[[["sequential_5",1,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization17",0,0,{}]]]},{"name":"dense_Dense25","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization17",0,0,{}]]]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization17",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention19","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention19","trainable":true},"inbound_nodes":[[["dense_Dense24",0,0,{}],["dense_Dense25",0,0,{}],["dense_Dense26",0,0,{}],["layer_normalization_LayerNormalization17",0,0,{}]]]},{"name":"add_Add6","class_name":"Add","config":{"name":"add_Add6","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization17",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention19",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization10","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization10","trainable":true},"inbound_nodes":[[["add_Add6",0,0,{}]]]},{"name":"dense_Dense36","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense36","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization10",0,0,{}]]]},{"name":"dense_Dense37","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense37","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"dense_Dense38","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense38","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention20","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention20","trainable":true},"inbound_nodes":[[["dense_Dense36",0,0,{}],["dense_Dense37",0,0,{}],["dense_Dense38",0,0,{}],["layer_normalization_LayerNormalization10",0,0,{}]]]},{"name":"add_Add10","class_name":"Add","config":{"name":"add_Add10","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization10",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention20",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization14","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization14","trainable":true},"inbound_nodes":[[["add_Add10",0,0,{}]]]},{"name":"sequential_6","class_name":"Sequential","config":{"name":"sequential_6","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense47","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense48","trainable":true}},{"class_name":"Dropout","config":{"rate":1,"noise_shape":null,"seed":null,"name":"dropout_Dropout8","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization14",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization18","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization18","trainable":true},"inbound_nodes":[[["sequential_6",1,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization18",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization18",0,0,{}]]]},{"name":"dense_Dense29","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization18",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention21","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention21","trainable":true},"inbound_nodes":[[["dense_Dense27",0,0,{}],["dense_Dense28",0,0,{}],["dense_Dense29",0,0,{}],["layer_normalization_LayerNormalization18",0,0,{}]]]},{"name":"add_Add7","class_name":"Add","config":{"name":"add_Add7","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization18",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention21",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization11","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization11","trainable":true},"inbound_nodes":[[["add_Add7",0,0,{}]]]},{"name":"dense_Dense39","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense39","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization11",0,0,{}]]]},{"name":"dense_Dense40","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense40","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"dense_Dense41","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense41","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention22","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention22","trainable":true},"inbound_nodes":[[["dense_Dense39",0,0,{}],["dense_Dense40",0,0,{}],["dense_Dense41",0,0,{}],["layer_normalization_LayerNormalization11",0,0,{}]]]},{"name":"add_Add11","class_name":"Add","config":{"name":"add_Add11","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization11",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention22",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization15","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization15","trainable":true},"inbound_nodes":[[["add_Add11",0,0,{}]]]},{"name":"sequential_7","class_name":"Sequential","config":{"name":"sequential_7","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense49","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense50","trainable":true}},{"class_name":"Dropout","config":{"rate":1,"noise_shape":null,"seed":null,"name":"dropout_Dropout9","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization15",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization19","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization19","trainable":true},"inbound_nodes":[[["sequential_7",1,0,{}]]]},{"name":"dense_Dense30","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense30","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization19",0,0,{}]]]},{"name":"dense_Dense31","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense31","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization19",0,0,{}]]]},{"name":"dense_Dense32","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense32","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization19",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention23","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention23","trainable":true},"inbound_nodes":[[["dense_Dense30",0,0,{}],["dense_Dense31",0,0,{}],["dense_Dense32",0,0,{}],["layer_normalization_LayerNormalization19",0,0,{}]]]},{"name":"add_Add8","class_name":"Add","config":{"name":"add_Add8","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization19",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention23",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization12","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization12","trainable":true},"inbound_nodes":[[["add_Add8",0,0,{}]]]},{"name":"dense_Dense42","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense42","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization12",0,0,{}]]]},{"name":"dense_Dense43","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense43","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"dense_Dense44","class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense44","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization8",0,0,{}]]]},{"name":"custom_attention_layer_SplitHeadsAndComputeAttention24","class_name":"SplitHeadsAndComputeAttention","config":{"name":"custom_attention_layer_SplitHeadsAndComputeAttention24","trainable":true},"inbound_nodes":[[["dense_Dense42",0,0,{}],["dense_Dense43",0,0,{}],["dense_Dense44",0,0,{}],["layer_normalization_LayerNormalization12",0,0,{}]]]},{"name":"add_Add12","class_name":"Add","config":{"name":"add_Add12","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization12",0,0,{}],["custom_attention_layer_SplitHeadsAndComputeAttention24",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization16","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization16","trainable":true},"inbound_nodes":[[["add_Add12",0,0,{}]]]},{"name":"sequential_8","class_name":"Sequential","config":{"name":"sequential_8","layers":[{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense51","trainable":true,"batch_input_shape":[null,128]}},{"class_name":"Dense","config":{"units":128,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense52","trainable":true}},{"class_name":"Dropout","config":{"rate":1,"noise_shape":null,"seed":null,"name":"dropout_Dropout10","trainable":true}}]},"inbound_nodes":[[["layer_normalization_LayerNormalization16",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization20","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization20","trainable":true},"inbound_nodes":[[["sequential_8",1,0,{}]]]},{"name":"final_layer","class_name":"Dense","config":{"units":2500,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"final_layer","trainable":true,"batch_input_shape":[null,[null,null,null]]},"inbound_nodes":[[["layer_normalization_LayerNormalization20",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0]],"output_layers":[["final_layer",0,0]]},"keras_version":"tfjs-layers 4.10.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.10.0","convertedBy":null,"weightsManifest":[{"paths":["./test-model.weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[2500,128],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization1/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization1/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization5/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization5/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization6/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization6/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization3/beta","shape":[128],"dtype":"float32"},{"name":"embedding_Embedding2/embeddings","shape":[2500,128],"dtype":"float32"},{"name":"dense_Dense17/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense17/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization7/gamma","shape":[128],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization7/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[128],